app/controllers/line_items_controller.rb

  def index
    # @line_items = LineItem.all
    @search = LineItem.all.ransack params[:q]
---
SELECT "line_items".* FROM "line_items"

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-06-30 03:57:50.282897"], ["updated_at", "2020-06-30 03:57:50.282897"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 1], ["cart_id", 19], ["created_at", "2020-07-07 01:49:05.984801"], ["updated_at", "2020-07-07 01:49:05.984801"]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["quantity", 2], ["updated_at", "2020-07-07 02:12:52.934169"], ["id", 1]]

  def update
    respond_to do |format|
      if @line_item.update(line_item_params)
---
UPDATE "line_items" SET "product_id" = ?, "updated_at" = ? WHERE "line_items"."id" = ?  [["product_id", 298486374], ["updated_at", "2020-07-02 01:44:03.478018"], ["id", 298486374]]