app/controllers/orders_controller.rb

SELECT "products".* FROM "products" ORDER BY "products"."title" ASC
SELECT "orders".* FROM "orders"
---
  def index
    if params[:set_locale]
      redirect_to store_index_url(locale: params[:set_locale])
    else
      @products = Product.order(:title)
    end
    @search = Order.all.ransack params[:q]

INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2020-07-03 05:20:10.830555"], ["updated_at", "2020-07-03 05:20:10.830555"]]
INSERT INTO "orders" ("name", "address", "email", "pay_type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "dave"], ["address", "asdfghjkl"], ["email", "asdfghjkl@gmail.com"], ["pay_type", 0], ["created_at", "2020-07-07 02:10:06.067835"], ["updated_at", "2020-07-07 02:10:06.067835"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 22]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])

UPDATE "orders" SET "pay_type" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["pay_type", 0], ["updated_at", "2020-06-30 07:12:15.166323"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT ?  [["cart_id", 22], ["LIMIT", 1]]
---
  def ensure_cart_isnt_empty
    if @cart.line_items.empty?