app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @search = Product.all.ransack params[:q]

UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = ?  [["image_url", "laptop-msi.png"], ["updated_at", "2020-06-30 01:37:06.961884"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @product.update(product_params)